{
  "dependencies": [
    "Cooking Pot"
  ],
  "tasks": {
    "pan": {
      "type": "heracles:item",
      "item": "farmersdelight:skillet",
      "nbt": {
        "Damage": 0
      },
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "farmersdelight:skillet",
          "count": 1,
          "nbt": {
            "Damage": 0
          }
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "xp": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 10,
      "title": "",
      "type": "heracles:xp"
    },
    "bacon": {
      "title": "",
      "icon": {
        "item": {
          "id": "farmersdelight:cooked_bacon",
          "count": 1
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "farmersdelight:cooked_bacon",
        "count": 16
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "Skillets can process any campfire cooking recipe, taking roughly 20% of the original time to cook each item (by default, 6 seconds for most recipes).",
      "",
      "It has two modes of operation:",
      "",
      "**Handheld**",
      "When a player is wielding a skillet close to any heat_sources, they'll be able to cook any valid items in their opposite hand by holding the use button. This takes just as long as the block-mode operation. Processed items are put in the player's inventory, or dropped if there's not enough space.",
      "",
      "Players are able to operate the Skillet by hand at any location if they're currently on fire.",
      "",
      "**Block**",
      "Players can sneak-use the skillet to place it down as a block. If placed above a valid heat source, it will be able to cook food items placed on it. The block form can hold on to a single stack of items, dropping them to the right side (handle pointing to the observer) when finished, requiring an item catcher to collect the items. Hoppers or Baskets are recommended.",
      "",
      "Skillets can be quickly mined by hand. The block will remember all of the item's traits, such as names, enchantments etc.",
      "",
      "**Weapon**",
      "Skillets can be used as a heavyweight melee weapon. They deal slightly less damage than an Iron Axe and have the same swing speed, but also possess higher knockback on each hit (roughly 2x as much). Their durability is the same as any Iron tool.",
      "",
      "**Enchantments**",
      "Skillets can receive the same enchantments that a Sword can, with the exception of Sweeping Edge.",
      "",
      "Fire Aspect will increase the Skillet's cooking speed slightly per level, for both handheld and block modes. As a block, a heated Fire Aspect skillet will emit magic sparks to indicate this."
    ],
    "groups": {
      "Food": {
        "position": [
          20,
          140
        ]
      }
    },
    "icon": {
      "item": {
        "id": "farmersdelight:skillet",
        "count": 1,
        "nbt": {
          "Damage": 0
        }
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Skillet"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}