{
  "dependencies": [
    "Elevator Pulley"
  ],
  "tasks": {
    "red c": {
      "type": "heracles:item",
      "item": "create:redstone_contact",
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "xp": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 10,
      "title": "",
      "type": "heracles:xp"
    },
    "Give Alloy": {
      "title": "",
      "icon": {
        "item": {
          "id": "create:redstone_contact",
          "count": 1
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "create:redstone_contact",
        "count": 3
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "In front of the onboard Redstone Contact, Redstone Contacts placed in a column and facing the onboard contact will turn into Elevator Contacts, there is no separate crafting recipe. Elevator contacts show as a separate item in JEI but they do not have a crafting recipe.",
      "",
      "These will be used to define the Elevator's \"floors.\" Once one Elevator Contact is placed, all Redstone Contacts placed at the same x and z coordinates afterwards will become Elevator Contacts.",
      "",
      "A lamp or noteblock placed adjacent to a contact will be activated when the elevator reaches the current floor. If a gold block is places below this with a space above the noteblock, it can be used as an elevator arrived bell.",
      "",
      "Elevator Contact UI",
      "Elevator Contacts can be given a redstone signal to call the elevator to them. They will also emit a redstone signal when the elevator is stopped at their floor. In their interface, floors can be given a name up to 4 characters long and a description up to 30 characters long. These will be displayed in Display Links and onboard Contraption Controls. Sliding Door functionality can also be adjusted to Open All Doors, open North, East, West, or South Side Doors only, or Keep Doors Closed. The interface will also tell you which way you are currently facing.",
      "",
      "Elevator Contacts will appear to light up slightly when an Elevator Pulley selects them before turning on when the Elevator Pulley reaches them."
    ],
    "groups": {
      "Create": {
        "position": [
          160,
          -20
        ]
      }
    },
    "icon": {
      "item": {
        "id": "create:redstone_contact",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Redstone Contact"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}