{
  "dependencies": [
    "Train Station"
  ],
  "tasks": {
    "track": {
      "type": "heracles:item",
      "item": "create:track",
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "xp": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 10,
      "title": "",
      "type": "heracles:xp"
    },
    "tracks": {
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "create:track",
        "count": 32
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "Train Tracks are special blocks used to support Trains.",
      "",
      "Placement:",
      "Right-click the ground to place a Train Track facing away from you. Train Tracks can be placed in eight different directions. Similarly to rails, Tracks can be manually placed to slope up hills, however the beginning of the slope must be linked together with assisted placement in order to be used properly by Trains.",
      "",
      "Right-click the Track with another Track in hand to place multiple Tracks at once, up to 35 blocks away. Use this to create bends or turns. Nearing a valid placement area, areas where Tracks can be placed will be highlighted in green. Hold sprint to make the bends more smooth. While placing multiple Tracks, if a valid material is held in the off-hand and there is space below the Tracks, it will automatically be paved beneath them. Metal Girders will appear to bend if paved beneath Tracks in this manner.",
      "",
      "Tracks can also be overlapped with each other to create more complex track systems.",
      "",
      "Unloaded Chunks:",
      "Trains will also continue through unloaded chunks. When arriving at a station in an unloaded chunk, the Train will stop as it normally does, however the chunk will NOT be loaded. Train Schedule conditions such as \"Item Cargo Condition\" may remain unfulfilled; set \"Chunk Unloaded\" as an alternative condition to have the Train continue anyways.",
      "",
      "Nether Portal Travel:",
      "Train Tracks can go through Nether Portals. Simply lead the Track to a portal, and it will link to the other side if it was already loaded once. A set of tracks will appear on the other side of the portal, making it easier to tell which way the Train will emerge from. While a wagon is part way through a nether portal, certain onboard machines such as Portable Storage or Portable Fluid Interfaces will not work.",
      "",
      "Train Creation:",
      "Add a Train Station to a straight track and begin Train Creation via the station's interface. By default, an assembly track can be up to 128 blocks long (adjustable in the Config.) Bogeys cannot be placed on curved Tracks.",
      "",
      "Train Signals:",
      "Train Tracks can logistically be divided into segments by Train Signals to control the traffic flow of non-player conductors. Conductors will not enter track a segment occupied by a Train, regardless of the size of the Train or segment. Pathways can be locked off by activating a Train Signal with Redstone, and approaching Trains will attempt to find another route to their station."
    ],
    "groups": {
      "Create": {
        "position": [
          200,
          -20
        ]
      }
    },
    "icon": {
      "item": {
        "id": "create:track",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Train Tracks"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}