{
  "dependencies": [
    "Train Tracks"
  ],
  "tasks": {
    "train controls": {
      "type": "heracles:item",
      "item": "create:controls",
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "xp": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 10,
      "title": "",
      "type": "heracles:xp"
    },
    "conductor cap": {
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "railways:red_conductor_cap",
        "count": 1
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "Train Controls are required in the creation of Trains.",
      "",
      "Train Creation:",
      "To assemble a Train, the train must have at least one set of controls that face forward relative to the Train Station the train is created at. If a non-player conductor is desired, a Blaze Burner or Seat must be placed directly behind the controls.",
      "",
      "Controls:",
      "On a Train, Train Controls can be right clicked to take control of the Train. The player's ordinary movement options will affect the Train instead. Use the controls again or sneak to stop. Hold left or right at a fork to choose a path. Use the scroll wheel to adjust maximum speed. Hold jump to approach and align at a Station. If a Steam Whistle is attached, press the sprint key to blow it.",
      "",
      "Co-piloting:",
      "Multiple conductors may be placed on a Train. When one is given a schedule, it corresponds to both. By having two sets of controls facing opposite directions, the train can move in both directions, though it will only switch directions while leaving a station and not while pathfinding to one Train Station. Note that a conductor must have access to each controller before it can be used.",
      "",
      "Taking control of a Train with a conductor on it will result in the Train Schedule being paused. Right-click the conductor to resume the schedule. If the controls are not rescinded, the throttle can be adjusted and the whistle may be blown freely as the conductor moves. While co-piloting, the conductor cannot be forced to skip a station, take a different path, or stop at an extra station."
    ],
    "groups": {
      "Create": {
        "position": [
          200,
          20
        ]
      }
    },
    "icon": {
      "item": {
        "id": "create:controls",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Train Controls"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}