{
  "dependencies": [
    "Train Schedule"
  ],
  "tasks": {
    "train": {
      "type": "heracles:item",
      "item": "create:track_signal",
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "create:track_signal",
          "count": 1
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "x": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 10,
      "title": "",
      "type": "heracles:xp"
    },
    "casing": {
      "title": "",
      "icon": {
        "item": {
          "id": "create:railway_casing",
          "count": 1
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "create:railway_casing",
        "count": 3
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "Train Signals are used to control the flow of Trains not driven by players.",
      "",
      "Placement:",
      "Right-click a Train Track with a Train Signal while facing the direction Trains are intended to go, then place the signal within 15 blocks of the selected Track. An arrow will appear on the selected Track indicating which way Trains can pass it.",
      "",
      "Two-way Tracks:",
      "Conductors will never cross a Train Signal from the opposite direction. Unlike other Railway Equipment, multiple Train Signals can select one track. A Train Signal can be made two-way by having two opposite facing Train Signals linked to the same place. Train Signals facing the same way on the same Track will be synchronized.",
      "",
      "Track Segments:",
      "Train Signals divide the track network into segments. The segments can be viewed by holding a Signal while looking at the Track. Conductors will not enter a track segment occupied by another Train, regardless of how large the Train or the segment is.",
      "",
      "In order to divide a Track into sections, each section must be separated either by a Train Signal or a lack of connected Tracks. A circular loop of Tracks requires two Train Signals to divide it, otherwise the Train Signals will have no effect. A straight track only needs one Train Signal to divide it into two. If a section was successfully defined, the line ahead of the Signal should become a different color. The color has no significance aside from serving to differentiate segments."
    ],
    "groups": {
      "Create": {
        "position": [
          200,
          140
        ]
      }
    },
    "icon": {
      "item": {
        "id": "create:track_signal",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Train Signal"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}