{
  "dependencies": [
    "Create Addons Page 2"
  ],
  "tasks": {
    "c c": {
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "type": "heracles:check"
    }
  },
  "rewards": {
    "x": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 10,
      "title": "",
      "type": "heracles:xp"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "Welcome to Create Central Kitchen, a mod offering more tools and methods to automate food processing for other mods in Create.",
      "",
      "We currently offer:",
      "- Pie Overhaul: Overhaul vanilla and modded pies in Farmer's Delight style, with placable blocks and slices. Cake Slice Integration: Add cake slices for non Farmer's Delight add-ons.",
      "- Fluid Integration: Provide fluid for sauces, drinks, ice creams and more!",
      "- Recipe Integration: Added hundreds of integration recipes in Create style, including Sequenced Assembly Recipes for Sandwiches, Burgers and Pies.",
      "- Reasonable Automatic Mixing: Shapeless Recipes with certain container items (Glass Bottle, Bowl, Bucket) involved are now excluded from Automatic Mixing.",
      "- Smarter Upright on Belt: Items with certain containers (Glass Bottle, Bowl, Bucket) are now automatically rendered upright on belt, without needing specifying item tag create:upright_on_belt.",
      "",
      "Specifically, when Farmer's Delight is installed:",
      "- Blaze Stove: Give your Blaze a guide and turn it into a master chef! Blaze Stove will provide Mechanical Arm support for kitchenwares including: Cooking Pot (Farmer's Delight), Kettle (Farmer's Respite), Copper Pot (Miner's Delight). Blaze Stove can also boost cooking up to 4x for the kitchenware above!",
      "- Cutting Board Recipe Automation: Deployer can now perform Cutting Board Recipes (Farmer's Delight) on Belt and Depot.",
      "- Smarter Basket: Basket (Farmer's Delight) can now directly interact with Belt and Mechanical Arm. Harvester Compat: Harvester is now compatible with Mushroom Colonies (Farmer's Delight), Tea Bush (Farmer's Respite), Coffee (Farmer's Respite), Propelplant (Nether's Delight), Lime Bush (Collector's Reap), Pomegranate Bush (Collector's Reap)"
    ],
    "groups": {
      "Create Addons pg 2": {
        "position": [
          -20,
          -60
        ]
      }
    },
    "icon": {
      "item": {
        "id": "create_central_kitchen:cooking_guide",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/octagons.png",
    "title": {
      "translate": "Create Central Kitchen"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": false,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}