{
  "dependencies": [
    "Experience Fountain"
  ],
  "tasks": {
    "dispeller": {
      "type": "heracles:item",
      "item": "experienceobelisk:precision_dispeller",
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "experienceobelisk:precision_dispeller",
          "count": 1
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "xp": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 100,
      "title": "",
      "type": "heracles:xp"
    },
    "crystal": {
      "title": "",
      "icon": {
        "item": {
          "id": "experienceobelisk:cognitive_crystal",
          "count": 1
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "experienceobelisk:cognitive_crystal",
        "count": 1
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "The Precision Dispeller is a specialized piece of machinery that allows you to selectively remove enchantments you don't want from an item, and remove curses for an XP cost. It also returns slightly more XP than a vanilla grindstone.",
      "",
      "The Precision Dispeller does not require binding to an Obelisk. When unbound, it will dispense any XP gained as XP orbs the same way as a vanilla grindstone, and draw XP from the player when removing curses.",
      "",
      "However, should you want to, the Precision Dispeller can be bound to an Obelisk the same way as the Fountain. When bound, experience gained will be added to the Obelisk internal reservoir instead of being released as XP orbs. Likewise, the XP cost from curse removal will first be deducted from the Obelisk, and only deducted from the player if the amount of XP in the Obelisk is insufficient.",
      "",
      "The XP returns and XP cost are shown in points, as well as base levels, or the number of levels you would have if you started at 0 levels and gained that amount of points. Base levels are absolute and do not scale with however much XP is on your person. So if you were to have 50 levels on your person, and remove a curse with a base level cost of 30, you would be left with around 44 levels. This is intentional and not a bug."
    ],
    "groups": {
      "Easy Automations": {
        "position": [
          100,
          25
        ]
      }
    },
    "icon": {
      "item": {
        "id": "experienceobelisk:precision_dispeller",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Precision Dispeller"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}